{
    "categories": {
        "0": "productivity",
        "1": "technical"
    },
    "demo_page": "https://usingplugin-gerador-hash.bubbleapps.io/version-test/",
    "description": "Este plugin pode ser utilizado para Codificar e Decodificar URI completo. \n\nUtiliza a função encodeURI  para codificar, exceto os caracteres (, / ? : @ & = + $ #) e a função encodeURIComponent() que codifica inclusive os caracteres (, / ? : @ & = + $ #).\n\nPara decodificar utiliza as funções encodeURI() e encodeURIComponent() respectivamente. \n\n\n----\n\nThis plugin can be used to Encode and Decode full URI.\n\nIt uses the encodeURI function to encode, except the characters (, / ? : @ & = + $ #) and the encodeURIComponent() function which encodes even the characters (, / ? : @ & = + $ #).\n\nTo decode it uses the functions encodeURI() and encodeURIComponent() respectively.",
    "image": "//s3.amazonaws.com/appforest_uf/f1662574637765x856233304140767700/W3Tools%20encodeurl.png",
    "license": "open_source",
    "link": "https://usingplugin-gerador-hash.bubbleapps.io/version-test/",
    "name": "Encode/Decode URL ",
    "plugin_instructions": "No workflow, clique em \"adicionar uma ação\" e dentre as opções no menu Plugins, escolha a que deseja utilizar: \n- Encode URL\n- Decode URL\n- Encode Component URL\n- Decode Component URL\n\nApós escolher a ação, selecione dinamicamente o elemento que tem o valor a ser (de)codificado ou insira diretamente o valor no campo \"Texto para codificar\". \n\nPara decodificar, o procedimento é o mesmo. Apenas escolha uma das funções de decodificação.\n\nO resultado gerado por estas ações, podem ser utilizadas no passo seguinte do workflow.\n\n----\n\nIn the workflow, click on \"add an action\" and among the options in the Plugins menu, choose the one you want to use:\n- Encode URL\n- Decode URL\n- Encode Component URL\n- Decode Component URL\n\nAfter choosing the action, dynamically select the element that has the value to be (de)encoded or directly enter the value in the \"Text to encode\" field.\n\nTo decode, the procedure is the same. Just choose one of the decoding functions.\n\nThe result generated by these actions can be used in the next step of the workflow."
}